Autodesk.Revit.DB.Lighting.LightDistributionStyle
Tags for specific light distribution styles
Since:
2013

Autodesk.Revit.DB.Lighting.LightDistributionStyle.PhotometricWeb
Photometric web (IES) light distribution.

Autodesk.Revit.DB.Lighting.LightDistributionStyle.Spot
Spot light distribution.

Autodesk.Revit.DB.Lighting.LightDistributionStyle.Hemispherical
Hemispherical light distribution.

Autodesk.Revit.DB.Lighting.LightDistributionStyle.Spherical
Spherical light distribution.